(function(){

	var header = document.getElementById('PoemsHead');
	var body = document.getElementById('PoemsBody');
	var footer = document.getElementById('PoemsFooter');
	var poemF1 = document.getElementById('PoemF1');
	var poemF2 = document.getElementById('PoemF2');
	var poemF3 = document.getElementById('PoemF3');
	var poemF4 = document.getElementById('PoemF4');
	var poemF5 = document.getElementById('PoemF5');
	var poemF6 = document.getElementById('PoemF6');
	var poemF7 = document.getElementById('PoemF7');
	var poemF8 = document.getElementById('PoemF8');
	var poemF9 = document.getElementById('PoemF9');
	var poemF10 = document.getElementById('PoemF10');

/*
	poem1.addEventListener('click', function(){
		alert("OK");
		header.innerText = "Заголовок";
		body.innerText = "Стих";
		footer.innerText = "(опубликовано )";
	});
*/

	poemF1.addEventListener('click', function(){
		header.innerText = "Виртуальный мир";
		body.innerText = "Остановилось время для меня\nИ я застрял в нем навсегда\nНо жизнь других я чувствую\nКак время их течёт я слушаю\nИ жизнь других со стороны\nВсегда идёт по одному пути.\nИ так легко, взять предсказать\nСобытий жизни чьих-то угадать\nНо не прочесть свою судьбу\nКак будто в пустоту смотрю.\nИ только виртуальный мир живой\nОн всех всегда зовёт с собой\nГотовый дать всем людям то\nЧего в реальности нам не дано.";
		footer.innerText = "(опубликовано 31.05.2023 10:16)";
	});

	poemF2.addEventListener('click', function(){
		header.innerText = "Ктулху";
		body.innerText = "Поднялись волны до небес.\nВдали на скалы Ктулху влез\nЯвился он из под воды\nИ час настал его поры.\n\nРаскаты грома, дождь полил,\nА ветер всё вокруг сносил,\nИ небо стало как свинец,\nКазалось что настал конец.\n\nИдет неторопливо шаг за шагом\nВода с него стекает водопадом.\nТак двигался как буд-то по воде\nСпособный говорить во сне.\n\nА за спиной его Р'льех\nИз под воды поднялся вверх\nПрекрасный город из глубин\nНа свете он такой один.";
		footer.innerText = "(опубликовано 23.11.2022 09:43)";
	});

	poemF3.addEventListener('click', function(){
		header.innerText = "Репликант Джо \nи голограмма Джой";
		body.innerText = "Мне в жизни не понятно ничего,\nНо мне с тобою так легко.\nМне почему-то хорошо\nИ всё на свете всё равно.\n\nЯ знаю что домой приду,\nТебя увижу, обниму,\nВ подарок «эманатор» подарю,\nТебя с собой всегда возьму.\n\nТы можешь облик взять любой\nЧтобы понравиться такой.\nТы можешь быть заботливой\nВсегда быть рядышком со мной.\n\nВсегда поддержишь, всё поймешь,\nТы не предашь и не соврёшь.\nТы любишь искренне меня,\nХотя всё это лишь игра.\n\nНа крыше дома мы стоим\nОбнявшись вместе, мы молчим,\nТвои слова: \"люблю тебя\"\nНе обязательные для меня.\n\nПрограммой так заложено\nЧто угождать положено.\nНо мне с тобою хорошо\nИ мне на это всё равно.\n\nНа нашем свете никогда\nТаких как ты не видел я.\nСреди людей таких здесь нет,\nИ я люблю искуственный интеллект.";
		footer.innerText = "(опубликовано 30.08.2018 11:16)\nЗа основу взяты персонажи фильма \"Бегущий по лезвию 2049\".";
	});
	
	poemF4.addEventListener('click', function(){
		header.innerText = "Оборотень";
		body.innerText = "Я жил самим собой,\nСудьба была жестокою со мной,\nДобро вносил я в каждый дом,\nНикто не видел проку в том.\n\nЛюдьми гонимый отовсюду,\nМеня преследуют по всюду,\nБегу от зла и от людей,\nЯ чувствую себя как зверь.\n\nИ вот когда мне места нет,\nМеня услышал наш отец,\nОн волком серым обернулся,\nК руке моей он прикоснулся.\n\nИ я почувствовал укус,\nИ тихий вой из волчьих уст,\nМне стало очень горячо,\nЗемля ударила в плечо.\n\nКогда сознание вернулось,\nВся жизнь моя перевернулась,\nТеперь взошедшая луна,\nМеняет облик у меня.\n\nЛюдьми я больше не гоним,\nОни добыча для меня,\nТеперь присутствие моё,\nНесет для человека зло.";
		footer.innerText = "(опубликовано 11.04.2017 08:49)";
	});

	poemF5.addEventListener('click', function(){
		header.innerText = "Большой взрыв";
		body.innerText = "Однажды в полной темноте,\nРождённый силою во тьме,\nНевероятной красотой,\nРаздался взрыв большой.\n\nОн положил всему начало,\nНачало времени пошло,\nИ всё вселенной зажило,\nИ смысл наконец-то обрело.\n\nИ первой родилась звезда,\nКоторую мы не увидим никогда,\nВсё это было так давно,\nНо нам остался след её.\n\nБыть может что звезда,\nДала луч света на всегда,\nИ одарила всё теплом,\nГде наш сегодня милый дом.\n\nИ всё живое на земле,\nКогда-то ожило во мгле,\nОбязано одной звезде,\nКоторую увидишь лишь во сне.";
		footer.innerText = "(опубликовано 11.04.2017 08:41)";
	});

	poemF6.addEventListener('click', function(){
		header.innerText = "Не верю";
		body.innerText = "Такого быть, не может быть,\nВсё что вокруг не объяснить,\nИ верить перестанешь сам,\nВся эта жизнь сплошной обман.\n\nПерестарался кто-то там,\nИ я не верю больше вам,\nНе верю в этот мир земной,\nНе настоящий он — пустой.\n\nЯ как бы вовсе не живу,\nОстановился и смотрю,\nМы вместе с вами в западне,\nНо вы в игре, а я во вне.\n\nМы под копирку все живём,\nИ так же одинаково уйдём,\nИ даже после смерти нас,\nВернут сюда в который раз.\n\nМир стал похожим на игру,\nЯ появился, вот живу,\nКуда-то с вами всё плыву,\nИ вместе с вами утону.";
		footer.innerText = "(опубликовано 11.04.2017 08:31)";
	});

	poemF7.addEventListener('click', function(){
		header.innerText = "Девять врат";
		body.innerText = "Пройду опять все девять врат,\nИ пусть там что не говорят,\nМне этот путь давно знаком,\nВедь я иду в свой отчий дом.\n\nТам всё не так, и всё не тут,\nНо я могу, там отдохнуть,\nИ это есть мой дом родной,\nИ там души не встретишь ни одной.\n\nПриду домой, туда где я,\nСпокойно чувствую себя,\nЯ вас с собою не зову,\nТам только то, что я люблю.";
		footer.innerText = "(опубликовано 11.04.2017 08:04)";
	});

	poemF8.addEventListener('click', function(){
		header.innerText = "Изоморф";
		body.innerText = "Теперь я знаю,\nКто же я такой,\nИ в отраженье больше,\nЯ не смотрю с тоской.\n\nМне есть чем жить,\nК чему стремиться вновь,\nЯ не такой как все,\nВо мне течет другая кровь.\n\nМне все всегда,\nСтавили в упрёк,\nТы изоморф,\nИ это твой порок.\nВам не понять,\nВсего что вижу я,\nВам никогда не стать,\nПохожим на меня.";
		footer.innerText = "(опубликовано 10.04.2017 14:59)";
	});

	poemF9.addEventListener('click', function(){
		header.innerText = "Вампир";
		body.innerText = "Я падший ангел, я вампир.\nИ этот мир, мне словно пир.\nЛишь днём я стану тенью нор\nНо это только до тех пор\nПока луны прекрасный взор\nНе сменит солнечный дозор.\n\nМышей летучих слышен хор\nИ я в ночи крадусь как вор.\nМой поиск жертв не знает мер.\nВам не помогут знаки вер.\nМоя охота — это тир\nИ вас не спрячет этот мир.\n\nМеня давно одолевает жар\nИ мне пора спустить свой пар.\nВам кажется что это вздор\nИ вы беспечны до сих пор.\nНо вы поверьте я вампир\nИ эта жизнь как вечный пир.";
		footer.innerText = "(опубликовано 10.04.2017 09:27)";
	});

	poemF10.addEventListener('click', function(){
		header.innerText = "Покинул землю навсегда";
		body.innerText = "Могу закрыть свои глаза,\nИ улететь под небеса,\nЗабыть о том что на земле,\nНикто не вспомнит обо мне.\n\nИ оторваться так легко,\nПодняться в небо высоко,\nИ больше, больше никогда,\nНе опускать свои глаза.\n\nИ я забуду обо всём,\nДа если б знали вы о том,\nКак надоела мне земля,\nИ я её покинул навсегда.";
		footer.innerText = "(опубликовано 10.04.2017 08:44)";
	});

}());